common/models/User.php

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => self::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`password_reset_token`='Hf-aJ0hQd5DXXHWr1-oGZ32clJ0u3Y1f_1524381570') AND (`status`=10)