frontend/models/ResetPasswordForm.php

UPDATE `user` SET `auth_key`='ncJTtsiI', `password_hash`='vprtwstiudjkn', `password_reset_token`=NULL, `updated_at`=1524381628 WHERE `id`=3
---
    public function resetPassword()
    {
        $user = $this->_user;
        $key = Vigenere::random_str(8);
        $user->auth_key = $key;
        $user->password_hash = Vigenere::Encipher($this->password, $key);
        $user->removePasswordResetToken();

        return $user->save(false);